library(stringr)
library(readxl)
library(dplyr)


https://map.kakao.com/link/to/방이동 백제고분군,37.5078722,127.118159
#https://map.kakao.com/link/to/카카오판교오피스,37.402056,127.108212
departure <- "순라길"

arrive <- "서울시민 광나루안전체험관"

url1 <- str_c("https://map.kakao.com/?sName=",departure,"&eName=",arrive,"&target=bike")
url1

df <- read_xlsx(path = "C:/Users/student/Desktop/ssemi_proj/실험.xlsx")
df <- as.data.frame(df)

방이동 백제고분군 X :127.118159, Y :37.5078722
몽촌토성 X :127.116064, Y :37.5209657
127.118159-127.116064+abs(37.5078722-37.5209657) 
# x 차이 0.002095 y 차이 0.0130935 9분 0.0151885
롯데월드 어드벤처 X :127.097998, Y :37.5112601
# x 0.021 y 0.0033879 9분 0.0235489

롯데 월드 기준
방이동 백제 고분# x 0.021 y 0.0033879 13분 0.0235489
몽촌토성 # 0.018066 0.0097056 22 분   0.0277716
127.097998-127.116064
37.5112601-37.5209657
올림픽공원 # 0.018066 0.0097056 13~22 분   0.0277716

순라길 x 126.991771 y 37.5773601
전기박물관 127.027976 y 37.4856812
11분 0.0235489
15.5분 0.0277716
df %>% filter(df, x>X-0.03 )  
df[1][df[2]>(X-0.003)]
View(df[a])
df
37.5807277	126.9699348

X-0.03
experi <- abs(126.9699348-127.027976) + abs(37.5807277-37.4856812)
experi / avg_time
1분당 위도 경도 차의 합
avg_time <- ((0.0235489/11)+(0.0277716/15.5))/2
avg_time 
  